content.org
#+HUGO_BASE_DIR: ./
#+STARTUP: indent

* About
:PROPERTIES:
:EXPORT_FILE_NAME: about
:EXPORT_HUGO_SECTION: /
:END:

I am a freelance and iOS and macOS developer based in London. You can find me online at various places with the username of =abizern=.

I strive to write modern and maintainable code. Primarily I work in Swift, having moved on from Objective-C, but I've also played around with Ruby, Python, Haskell, and Common Lisp.

I organise the monthly [[http://nscodernightlondon.com][NSCoder Night London]] meetup when iOS and macOS developers meet to chat. Unfortunately this has gone on hiatus because of the Pandemic, but I'm looking to start it up again soon.

You can see my old blog over at [[https:abizern.org][abizern.org]] but I'm going to keep this one just for developer stuff and code.

** Contract availability
I'm available for new contracts.

** GPG

Key ID: =7E2C07666BEEED1C=

Key Signature: =CF1C 8FE5 A508 0E70 4BCB  97DE 7E2C 0766 6BEE ED1C=

Key: Available on a keyserver near you, or you can [[/res/GPGKey.asc][download it here]].                                               

